In [12]:
import os
import pandas as pd

In [8]:
# 경로는 환경에 맞게 수정. 예: 환경 변수 DATA_ROOT 또는 로컬 경로
folder_path = os.environ.get("DATA_ROOT", "./resources/archive")
dataset_path = os.path.join(folder_path, "lfw-deepfunneled", "lfw-deepfunneled")

In [10]:
csv_path = os.path.join(folder_path, "people.csv")
csv_path

In [27]:
df = pd.read_csv(csv_path)
df = df[~df['images'].isna()].reset_index(drop=True)
df['images'] = df['images'].astype(int)
df

                        name  images
0         Abdel_Madi_Shabneh       1
1               Abdul_Rahman       1
2               Abel_Pacheco       4
3               Adriana_Lima       1
4                Afton_Smith       1
...                      ...     ...
5744            Yves_Brodeur       1
5745             Zach_Pillar       1
5746  Zafarullah_Khan_Jamali       2
5747          Zara_Akhmadova       1
5748              Zhu_Rongji       9

[5749 rows x 2 columns]

In [29]:
valid_df = df[df['images']>1].reset_index(drop=True)
valid_df

                        name  images
0               Abel_Pacheco       4
1             Akhmed_Zakayev       3
2       Alejandro_Atchugarry       2
3              Amber_Tamblyn       2
4      Anders_Fogh_Rasmussen       4
...                      ...     ...
1675      Vladimir_Voltchkov       2
1676                 Wang_Yi       2
1677           William_Burns       2
1678  Zafarullah_Khan_Jamali       2
1679              Zhu_Rongji       9

[1680 rows x 2 columns]

In [30]:
valid_df.to_csv('data_for_face_reco.csv', index=False)